#include <iostream>
#include <math.h>

using namespace std;
void task()
{
    int age;
    while (true)
    {
        cout << "Введи свій вік\n 00 - вихід\n";
        cin >> age;
        if (age >= 18)
        {
            cout << "Ви маєте право голосу!\n";
        }
        //^--- перевірка на вік якщо є 18 або більше результат true
        else
        {
            cout << "У вас немає права вибору,так ,як вам не виповнилося 18\nЧерез : " << 18 - age << " роки ви зможете мати право голосу\n";
        }
        //^--- вивід речення з віком який потрібно досягнути
        if (age == 00)
        {
            break;
        }
        //^--- вихід з циклу
    }
}

int main()
{
    task();
}
